W9/background/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
	(0 -2 0)     //0
	(12 -2 0)   //1
	(12 2 0)    //2
	(0 2 0)      //3
	(0 -2 0.9)  //4
	(12 -2 0.9)//5
	(12 2 0.9) //6
	(0 2 0.9)   //7
    (0 -2 1.35)  //8
	(12 -2 1.35)//9
	(12 2 1.35) //10
	(0 2 1.35)   //11
);



blocks
(
	hex (0 1 2 3 4 5 6 7)  (237 103 29)
	simpleGrading
	(
		(
			(0.188 0.158  1 )
			(0.021 0.025 0.33)
			(0.083 0.211  1)
			(0.021 0.025 3)
			(0.688 0.58 1)
		)
		(
			(0.312 0.204 1)
			(0.063 0.058 0.33)
			(0.25 0.485 1)
			(0.063 0.058 3)
			(0.312 0.204 1)
		)
		(
			(0.47 0.24 1)
			(0.14 0.13 0.333)
			(0.39 0.642 1)				
		)
		
	)
    hex (4 5 6 7 8 9 10 11) (237 103 23)
	simpleGrading
	(
		(
			(0.188 0.158  1 )
			(0.021 0.025 0.33)
			(0.083 0.211  1)
			(0.021 0.025 3)
			(0.688 0.58 1)
		)
		(
			(0.312 0.204 1)
			(0.063 0.058 0.33)
			(0.25 0.485 1)
			(0.063 0.058 3)
			(0.312 0.204 1)
		)
		(
			(0.78 0.782 1) 
			(0.22 0.217 3)
								
		)
		
	)
);

edges
(
);

boundary
(

    oversetPatch
    {
        type overset;
        faces ();
   }

    inlet
    {
        type patch;
        faces
        (
			(0	4	7	3)
            (4  8  11   7)
			
        );
    }
	
    outlet
    {
        type patch;
        faces
        (
			(1 2 6 5)
            (5 6 10 9)
        );
    }
	
    ground
    {
        type wall;
        faces
        (
			(0	3	2	1)
			

        );
    }
	
	
    walls
    {
        type patch;
        faces
        (
			(0 1 5 4)
            (4 5 9 8)
			(2 3 7 6)
            (6 7 11 10)
        );
    }
	
    atmosphere
    {
        type patch;
        faces
        (
			(8 9 10 11)
			
        );
    }

    floatingObject
    {
        type wall;
        faces ();
    }
);

// ************************************************************************* //
